{
  "broadArea": {
    "name": "Electronics and Communication Engineering",
    "link": "https://www.vlab.co.in/broad-area-electronics-and-communications",
    "code": "ECE"
  },
  "lab": "Digital Signal Processing",
  "lab_display_name": "Digital Signal Processing",
  "phase": 2,
  "collegeName": "IITKGP",
  "baseUrl": "dsp-iitkgp.vlabs.ac.in",
  "introduction": "The DSP Virtual Laboratory is an initiative of Ministry of Human Resource Development (MHRD), Govt. of India, under the National Mission on Education through Information and Communication Technology (NME-ICT). Laboratory courses on hands-on experiments are an integral part of engineering education. The content of this website aims to provide a virtual laboratory platform for undergraduate Engineering students studying the course of Digital Signal Processing.",
  
  "experiments": [
    {
      "name": "Study of sampling theorem, effect of undersampling",
      "short-name": "sampling-theorem",
      "repo": "https://github.com/virtual-labs/exp-sampling-theorem-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Study of Quantization of Continuous-Amplitude, Discrete-Time Analog Signals",
      "short-name": "quantization-continuous-amplitude",
      "repo": "https://github.com/virtual-labs/exp-quantization-continuous-amplitude-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Study of Different Types of Companding Techniques",
      "short-name": "companding-techniques",
      "repo": "https://github.com/virtual-labs/exp-companding-techniques-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Study of properties of Linear Time-Invariant System",
      "short-name": "linear-time-invariant",
      "repo": "https://github.com/virtual-labs/exp-linear-time-invariant-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Study of convolution Series and Parallel System",
      "short-name": "convolution-parallel-system",
      "repo": "https://github.com/virtual-labs/exp-convolution-parallel-system-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Study of Discrete Fourier Transform (DFT) and its inverse",
      "short-name": "fourier-transform",
      "repo": "https://github.com/virtual-labs/exp-discrete-fourier-transform-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Study of Transform domain properties and its use",
      "short-name": "transform-domain",
      "repo": "https://github.com/virtual-labs/exp-transform-domain-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Study of FIR filter design using window method: Lowpass and highpass filter",
      "short-name": "fir-lowpass-highpass",
      "repo": "https://github.com/virtual-labs/exp-fir-lowpass-highpass-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Study of FIR filter design using window method: Bandpass and Bandstop filter",
      "short-name": "fir-bandpass-bandstop",
      "repo": "https://github.com/virtual-labs/exp-fir-bandpass-bandstop-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    },
    {
      "name": "Study of Infinite Impulse Response (IIR) filter",
      "short-name": "infinite-impulse-response",
      "repo": "https://github.com/virtual-labs/exp-infinite-impulse-response-iitkgp",
      "tag": "v1.0.0",
      "deploy": true
    }
  ],
  "targetAudience": {
  "UG":[
    "Undergraduate students students of Electronics and Electrical Engineering"
  ],
    "PG": [
      "Post-graduate students of Electronics and Electrical Engineering"
    ]
  },
    
  "objective": "**Enhance Theoretical Understanding through Practical Application**: Provide a platform for students to apply DSP concepts, enabling a deeper understanding of theories such as sampling, filtering, Fourier analysis, and signal transformation.\n\n**Hands-On Experience with DSP Tools**: Familiarize students with DSP tools and software used in the industry, such as MATLAB, Python, and other DSP-specific software environments, to build relevant technical skills.\n\n**Develop Problem-Solving Skills**: Encourage students to solve real-world problems related to signal processing, fostering skills in analyzing, designing, and implementing DSP systems for applications in communications, audio processing, image processing, and more.\n\n**Facilitate Self-Paced Learning**: Allow students to explore and experiment with DSP techniques at their own pace, enabling personalized learning experiences and flexible access to resources.\n\n**Bridge Gap Between Theory and Application**: Provide an interactive environment where students can visually and practically understand abstract DSP concepts, bridging the gap between theoretical study and practical application.\n\n**Support Experimentation in a Safe Environment**: Enable students to simulate and test DSP algorithms and systems in a virtual setting, avoiding the need for expensive hardware and reducing the risks associated with physical equipment.\n\n**Encourage Collaborative Learning and Sharing**: Provide tools for students to collaborate, share their solutions, and learn from each other, fostering a community of practice around DSP concepts and techniques.\n\n**Prepare for Advanced DSP Topics and Research**: Equip students with foundational skills and knowledge that will prepare them for more advanced DSP topics and potential research areas within the field of digital signal processing.\n\n**Assessment and Feedback**: Offer automated assessments, feedback, and performance tracking to help students measure their progress and identify areas for improvement.\n\n**Facilitate Remote Learning and Accessibility**: Make DSP education accessible to students regardless of location, supporting remote learning and increasing accessibility to quality DSP education resources.\n\nThese objectives ensure that students gain both practical and theoretical knowledge in DSP, preparing them for industry applications and advanced studies.",
  "courseAlignment": {
    "description": "The lab contents are chosen such that it covers the syllabi of the Electronics and Electrical Engineering course's of various universities.",
    "universities": [
      "IIT Kharagpur"
    ]
  }
}
